# 5

## 5.1

In [296]:
import pandas as pd

In [297]:
pd.read_csv("../DATA/employees.csv")

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

In [298]:
pd.read_csv("../DATA/employees.csv", parse_dates=["Start Date"]).head()

/var/folders/9y/lpn0hjmn5csct06t4_r5qtjr0000gn/T/ipykernel_40897/4114072625.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pd.read_csv("../DATA/employees.csv", parse_dates=["Start Date"]).head()

  First Name  Gender Start Date    Salary   Mgmt       Team
0    Douglas    Male 1993-08-06       NaN   True  Marketing
1     Thomas    Male 1996-03-31   61933.0   True        NaN
2      Maria  Female        NaT  130590.0  False    Finance
3      Jerry     NaN 2005-03-04  138705.0   True    Finance
4      Larry    Male 1998-01-24  101004.0   True         IT

In [299]:
employees = pd.read_csv("../DATA/employees.csv", parse_dates=["Start Date"])

/var/folders/9y/lpn0hjmn5csct06t4_r5qtjr0000gn/T/ipykernel_40897/1058059249.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  employees = pd.read_csv("../DATA/employees.csv", parse_dates=["Start Date"])

In [300]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.1+ KB

### 5.1.1

In [301]:
employees["Mgmt"].astype(bool)

0        True
1        True
2       False
3        True
4        True
        ...
996     False
997     False
998     False
999      True
1000     True
Name: Mgmt, Length: 1001, dtype: bool

In [302]:
employees["Mgmt"] = employees["Mgmt"].astype(bool)

In [303]:
employees.tail()

     First Name Gender Start Date    Salary   Mgmt          Team
996     Phillip   Male 1984-01-31   42392.0  False       Finance
997     Russell   Male 2013-05-20   96914.0  False       Product
998       Larry   Male 2013-04-20   60500.0  False  Business Dev
999      Albert   Male 2012-05-15  129949.0   True         Sales
1000        NaN    NaN        NaT       NaN   True           NaN

In [304]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), datetime64[ns](1), float64(1), object(3)
memory usage: 40.2+ KB

In [305]:
employees["Salary"].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [ ]:
employees["Salary"].fillna(0).tail()

In [ ]:
employees["Salary"].fillna(0).astype(int).tail()

In [ ]:
employees["Salary"]=employees["Salary"].fillna(0).astype(int)

In [ ]:
employees.nunique()

In [ ]:
employees["Gender"].astype("category")

In [ ]:
employees["Gender"] =employees["Gender"].astype("category")

In [ ]:
employees["Team"] = employees["Team"].astype("category")

In [ ]:
employees.info()

## 5.2

In [ ]:
"Maria" == "Maria"

In [ ]:
"Maria" == "Taylor"

In [ ]:
# Series ==value

In [ ]:
employees["First Name"] == "Maria"

In [ ]:
employees[employees["First Name"] == "Maria"]

In [ ]:
marias = employees["First Name"] =="Maria"
employees[marias]

In [ ]:
"Finance" != "Engineering"

In [ ]:
employees["Team"] != "Finance"

## 5.3

### 5.3.1

In [ ]:
is_female = employees["Gender"]=="Female"

In [ ]:
in_biz_dev = employees["Team"] == "Business Dev"

In [ ]:
employees[is_female & in_biz_dev].head()

In [ ]:
is_manager = employees["Mgmt"]
employees[is_female & in_biz_dev & is_manager].head()

In [ ]:
earning_below_40k = employees["Salary"]<40000
started_after_2015 = employees["Start Date"] > "2015-01-01"
employees[earning_below_40k | started_after_2015].tail()

In [ ]:
my_series = pd.Series([True, False, True])
my_series

In [ ]:
~my_series

In [ ]:
employees[employees["Salary"]<100000].head()

In [ ]:
employees[~(employees["Salary"] > 100000)].head()

### 5.3.2

In [ ]:
earning_below_40k = employees["Salary"] < 40000
started_after_2015 = employees["Start Date"] > "2015-01-01"

In [ ]:
is_female = employees["Gender"] == "Female"

In [ ]:
in_biz_dev = employees["Team"] == "Business Dev"

In [ ]:
employees[is_female & in_biz_dev].head()

In [ ]:
is_manager= employees["Mgmt"]
employees[is_female & in_biz_dev & is_manager].head()

### 5.3.2 OR ì¡°ê±´

In [ ]:
earning_below_40k = employees["Salary"] < 40000
started_after_2015 = employees["Start Date"] > "2015-01-01"

In [ ]:
employees[earning_below_40k | started_after_2015].tail()

### 5.3.3 ~ê¸°í˜¸ë¡œ ë°˜ì „

In [ ]:
my_series = pd.Series([True, False, True])
my_series

In [ ]:
~my_series

In [ ]:
employees[employees["Salary"] < 100000].head()

In [ ]:
employees[~(employees["Salary"] > 100000)].head()

### 5.3.4 ë¶ˆë¦¬ì–¸ ë©”ì„œë“œ

== , !=, >, >=, <, <=,

## 5.4

### 5.4.1

In [ ]:
sales= employees["Team"] == "Sales"

In [ ]:
legal = employees["Team"] == "Legal"

In [ ]:
mktg = employees["Team"] == "Marketing"

In [ ]:
employees[sales|legal|mktg].head()

In [ ]:
all_star_teams = ["Sales", "Legal", "Marketing"]
on_all_star_teams = employees["Team"].isin(all_star_teams)
employees[on_all_star_teams].head()

### 5.4.2

In [ ]:
higher_than_80 = employees["Salary"]>= 80000
lower_than_90 = employees["Salary"]<90000
employees[higher_than_80 & lower_than_90].head()

In [ ]:
between_80k_and_90k = employees["Salary"].between(80000,90000)
employees[between_80k_and_90k].head()

In [ ]:
eights_folk=employees["Start Date"].between(
    left = "1980-01-01",
    right = "1990-01-01")

employees[eights_folk].head()

In [ ]:
name_starts_with_r = employees["First Name"].between("R", "S")
employees[name_starts_with_r].head()

### 5.4.3

In [ ]:
employees.head()

In [ ]:
employees["Team"].isnull().head()

In [ ]:
employees["Start Date"].isnull().head()

In [ ]:
employees["Team"].notnull().head()

In [ ]:
(~employees["Team"].notnull()).head()

In [ ]:
no_team = employees["Team"].isnull()
employees[no_team].head()

In [ ]:
has_name = employees["First Name"].notnull()
employees[has_name].tail()

### 5.4.4

In [ ]:
employees

In [ ]:
employees.dropna()

In [ ]:
employees.dropna(how = "all").tail()

In [ ]:
employees.dropna(how = "any").tail()

In [ ]:
employees.dropna(subset=["Gender"]).tail()

In [ ]:
employees.dropna(subset=["Start Date", "Salary"]).head()

In [ ]:
employees.dropna(how = "any", thresh=4).head()

## 5.5

### 5.5.1

In [ ]:
employees["Team"].head()

In [ ]:
employees["Team"].duplicated().head()

In [ ]:
employees["Team"].duplicated(keep="first").head()

In [ ]:
employees["Team"].duplicated(keep="last")

In [ ]:
(~employees["Team"].duplicated()).head()

In [ ]:
first_one_in_team = ~employees["Team"].duplicated()
employees[first_one_in_team]

### 5.5.2

In [ ]:
employees.drop_duplicates()

In [ ]:
employees.drop_duplicates(subset = ["Team"])

In [ ]:
employees.drop_duplicates(subset = ["Team"], keep='last')

In [ ]:
employees.drop_duplicates(subset = ["First Name"], keep = False)

In [ ]:
name_is_douglas = employees["First Name"] == "Douglas"
is_male = employees["Gender"] == "Male"
employees[name_is_douglas & is_male]

In [ ]:
employees.drop_duplicates(subset = ["Gender", "Team"]).head()

## 5.6

In [306]:
file = pd.read_csv("../DATA/netflix.csv", parse_dates=["date_added"])

file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5837 entries, 0 to 5836
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   title       5837 non-null   object
 1   director    3936 non-null   object
 2   date_added  5195 non-null   datetime64[ns]
 3   type        5837 non-null   object
dtypes: datetime64[ns](1), object(3)
memory usage: 182.5+ KB

/var/folders/9y/lpn0hjmn5csct06t4_r5qtjr0000gn/T/ipykernel_40897/93384610.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  file = pd.read_csv("../DATA/netflix.csv", parse_dates=["date_added"])

In [307]:
file["type"] = file["type"].astype("category")
file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5837 entries, 0 to 5836
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   title       5837 non-null   object
 1   director    3936 non-null   object
 2   date_added  5195 non-null   datetime64[ns]
 3   type        5837 non-null   category
dtypes: category(1), datetime64[ns](1), object(2)
memory usage: 142.8+ KB

In [308]:
a = file[file["title"] == "Limitless"]
a

          title         director date_added     type
1559  Limitless      Neil Burger 2019-05-16    Movie
2564  Limitless              NaN 2016-07-01  TV Show
4579  Limitless  Vrinda Samartha 2019-10-01    Movie

In [309]:
RR = file[file["director"]=="Robert Rodriguez"]
RR
RRM = RR[RR["type"] == "Movie"]
RRM

,title,director,date_added,type
1384,Spy Kids: All the Time in the World,Robert Rodriguez,2019-02-19,Movie
1416,Spy Kids 3: Game Over,Robert Rodriguez,2019-04-01,Movie
1460,Spy Kids 2: The Island of Lost Dreams,Robert Rodriguez,2019-03-08,Movie
2890,Sin City,Robert Rodriguez,2019-10-01,Movie
3836,Shorts,Robert Rodriguez,2019-07-01,Movie
3883,Spy Kids,Robert Rodriguez,2019-04-01,Movie

In [310]:
a = file['date_added'] == '2019-07-31'
a
# b = file[file['director'] == 'Robert Altman']
# b

0       False
1       False
2       False
3       False
4       False
        ...
5832    False
5833    False
5834    False
5835    False
5836    False
Name: date_added, Length: 5837, dtype: bool

In [311]:
b = file['director'] == 'Robert Altman'
b

0       False
1       False
2       False
3       False
4       False
        ...
5832    False
5833    False
5834    False
5835    False
5836    False
Name: director, Length: 5837, dtype: bool

In [312]:
file[ a | b ]

                                title       director date_added     type
611                            Popeye  Robert Altman 2019-11-24    Movie
1028        The Red Sea Diving Resort    Gideon Raff 2019-07-31    Movie
1092                     Gosford Park  Robert Altman 2019-11-01    Movie
3473  Bangkok Love Stories: Innocence            NaN 2019-07-31  TV Show
5117                       Ramen Shop      Eric Khoo 2019-07-31    Movie

In [313]:
a = file['director'] == 'Orson Welles'
b = file['director'] == 'Aditya Kripalani'
c = file['director'] == 'Sam Raimi'

file [a | b | c]

                           title          director date_added   type
946                 The Stranger      Orson Welles 2018-07-19  Movie
1870                    The Gift         Sam Raimi 2019-11-20  Movie
3706                Spider-Man 3         Sam Raimi 2019-11-01  Movie
4243        Tikli and Laxmi Bomb  Aditya Kripalani 2018-08-01  Movie
4475  The Other Side of the Wind      Orson Welles 2018-11-02  Movie
5115    Tottaa Pataaka Item Maal  Aditya Kripalani 2019-06-25  Movie

In [314]:
a = file["date_added"].between("2019-05-01", "2019-06-01")
file[a]

,title,director,date_added,type
29,Chopsticks,Sachin Yardi,2019-05-31,Movie
60,Away From Home,NaN,2019-05-08,TV Show
82,III Smoking Barrels,Sanjib Dey,2019-06-01,Movie
108,Jailbirds,NaN,2019-05-10,TV Show
124,Pegasus,Han Han,2019-05-31,Movie
...,...,...,...,...
5671,Satan & Adam,V. Scott Balcerek,2019-06-01,Movie
5675,Rim of the World,McG,2019-05-24,Movie
5677,Malibu Rescue,Savage Steve Holland,2019-05-13,Movie
5739,Mission Istaanbul: Darr Ke Aagey Jeet Hai,Apoorva Lakhia,2019-05-16,Movie
5829,The Kindness Diaries,NaN,2019-05-01,TV Show

In [315]:
file.dropna(subset = ["director"])

                                   title        director date_added   type
1                         A Patch of Fog  Michael Lennox 2017-04-15  Movie
3                              Uriyadi 2     Vijay Kumar 2019-08-02  Movie
4                      Shrek the Musical     Jason Moore 2013-12-29  Movie
5                       Schubert In Love     Lars BÃ¼chel 2018-03-01  Movie
6     We Have Always Lived in the Castle   Stacie Passon 2019-09-14  Movie
...                                  ...             ...        ...    ...
5830                         Bibi & Tina     Detlev Buck 2017-04-15  Movie
5832                         The Pursuit     John Papola 2019-08-07  Movie
5833                    Hurricane Bianca   Matt Kugelman 2017-01-01  Movie
5834                        Amar's Hands  Khaled Youssef 2019-04-26  Movie
5835               Bill Nye: Science Guy  Jason Sussberg 2018-04-25  Movie

[3936 rows x 4 columns]

In [316]:
file["date_added"].nunique()


file.drop_duplicates(subset = ["date_added"], keep = False)

,title,director,date_added,type
4,Shrek the Musical,Jason Moore,2013-12-29,Movie
12,Without Gorky,Cosima Spender,2017-05-31,Movie
30,Anjelah Johnson: Not Fancy,Jay Karas,2015-10-02,Movie
38,One Last Thing,Tim Rouhana,2019-08-25,Movie
70,Marvel's Iron Man & Hulk: Heroes United,Leo Riley,2014-02-16,Movie
...,...,...,...,...
5748,Menorca,John Barnard,2017-08-27,Movie
5749,Green Room,Jeremy Saulnier,2018-11-12,Movie
5788,Chris Brown: Welcome to My Life,Andrew Sandler,2017-10-07,Movie
5789,A Very Murray Christmas,Sofia Coppola,2015-12-04,Movie
5812,Little Singham in London,Prakash Satam,2019-04-22,Movie